{
   "defaultExercise": [
        {
            "order": 0,
            "name": "Bicep Curl",
            "repTime": 3,
            "desc": "The biceps curl mainly targets the biceps brachii, brachialis and brachioradialis muscles. The biceps is stronger at elbow flexion when the forearm is supinated (palms turned upward) and weaker when the forearm is pronated. The brachioradialis is at its most effective when the palms are facing inward, and the brachialis is unaffected by forearm rotation. Therefore, the degree of forearm rotation affects the degree of muscle recruitment between the three muscles.",
            "tutorial": "https://youtu.be/ykJmrZ5v0Oo",
            "isFavourite": false,
            "isHold": false,
            "userCreated": false,
            "isLearnt": true,
            "isRotation": true,
            "category": "Upper Body",
            "equipment": "Dumbbells"
        },
        {
            "order": 0,
            "name": "Squat",
            "repTime": 3,
            "desc": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent of a squat, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up.\n\nSquats are considered a vital exercise for increasing the strength and size of the lower body muscles as well as developing core strength. The primary agonist muscles used during the squat are the quadriceps femoris, the adductor magnus, and the gluteus maximus. The squat also isometrically uses the erector spinae and the abdominal muscles, among others.",
            "tutorial": "https://youtu.be/aclHkVaku9U",
            "isFavourite": false,
            "isHold": false,
            "userCreated": false,
            "isLearnt": false,
            "isRotation": false,
            "category": "Lower Body",
            "equipment": "Barbell"
        },
        {
            "order": 0,
            "name": "Shoulder Press",
            "repTime": 3,
            "desc": "The overhead press is an upper-body weight training exercise in which the trainee presses a weight overhead while seated or standing.\n\nThe lift is set up by taking either a barbell or a pair of dumbbells (or even kettlebells) and putting it in a racking position. The weight is then pressed overhead. While the exercise can be performed standing or seated, standing recruits more muscle fiber as more balancing is required in order to support the lift.",
            "tutorial": "https://youtu.be/qEwKCR5JCog",
            "isFavourite": false,
            "isHold": false,
            "userCreated": false,
            "isLearnt": true,
            "isRotation": false,
            "category": "Upper Body",
            "equipment": "Dumbbells"
        },
        {
            "order": 0,
            "name": "Lunge",
            "repTime": 4,
            "desc": "Lunges are a good exercise for strengthening, sculpting and building several muscles/muscle groups, including the quadriceps (or thighs), the gluteus maximus (or buttocks) as well as the hamstrings. A long lunge emphasizes the use of the gluteals whereas a short lunge emphasizes the quadriceps. The lunge is a basic movement that is fairly simple to do for beginner athletes.\n\nA lunge can be performed using bodyweight alone. However, weight trainers may seek to increase the difficulty using either dumbbells or kettlebells held in each hand, or a barbell held atop the neck and shoulders. Grip strength may be an issue with the dumbbell lunge so practitioners may prefer the barbell lunge.",
            "tutorial": "https://youtu.be/QOVaHwm-Q6U",
            "isFavourite": false,
            "isHold": false,
            "userCreated": false,
            "isLearnt": false,
            "isRotation": false,
            "category": "Lower Body",
            "equipment": "Dumbbells"
        },
        {
            "order": 0,
            "name": "Rest",
            "repTime": 5,
            "desc": "Rest is important during strength workouts!",
            "tutorial": "",
            "isFavourite": false,
            "isHold": true,
            "userCreated": false,
            "isLearnt": false,
            "isRotation": false,
            "category": "All",
            "equipment": "Bodyweight"
        },
        {
            "order": 0,
            "name": "Crunch",
            "repTime": 2,
            "desc": "The crunch is one of the most popular abdominal exercises. When performed properly, it engages all the abdominal muscles but primarily it works the rectus abdominis muscle and the obliques. It allows both building six-pack abs, and tightening the belly. Crunches use the exerciser's own body weight to tone muscle, and are recommended as a low-cost exercise that can be performed at home.",
            "tutorial": "https://youtu.be/NGRKFMKhF8s",
            "isFavourite": false,
            "isHold": false,
            "userCreated": false,
            "isLearnt": false,
            "isRotation": true,
            "category": "Core",
            "equipment": "Bodyweight"
        },
        {
            "order": 0,
            "name": "Lateral Raise",
            "repTime": 3,
            "desc": "A fly or lateral raise is a strength training exercise in which the hand and arm move through an arc while the elbow is kept at a constant angle. Flies are used to work the muscles of the upper body. Because these exercises use the arms as levers at their longest possible length, the amount of weight that can be moved is significantly less than equivalent press exercises for the same muscles (the military press and bench press for the shoulder and chest respectively). Due to this leverage, fly exercises of all types have a large potential to damage the shoulder joint and its associated ligaments and the tendons of the muscles connecting to it. They should be done with caution and their effects first tested while using very light weights; which are gradually incremented after more strength is gained.",
            "tutorial": "https://youtu.be/3VcKaXpzqRo",
            "isFavourite": false,
            "isHold": false,
            "userCreated": false,
            "isLearnt": true,
            "isRotation": true,
            "category": "Upper Body",
            "equipment": "Dumbbells"
        },
        {
            "order": 0,
            "name": "Leg Press",
            "repTime": 3,
            "desc": "The leg press is a compound weight training exercise in which the individual pushes a weight or resistance away from them using their legs. The term leg press machine refers to the apparatus used to perform this exercise. The leg press can be used to evaluate an athlete's overall lower body strength (from the gluteus Maximus to the lower leg muscles). It can help to build squat strength. If performed correctly, the inclined leg press can help develop knees to manage heavier free weights, on the other hand, it has the potential to inflict grave injury: the knees could bend the wrong way if they are locked during the exercise.",
            "tutorial": "https://youtu.be/IZxyjW7MPJQ",
            "isFavourite": false,
            "isHold": false,
            "userCreated": false,
            "isLearnt": false,
            "isRotation": false,
            "category": "Lower Body",
            "equipment": "Bodyweight"
        },
        {
            "order": 0,
            "name": "Box Jump",
            "repTime": 4,
            "desc": "The leg press is a compound weight training exercise in which the individual pushes a weight or resistance away from them using their legs. The term leg press machine refers to the apparatus used to perform this exercise. The leg press can be used to evaluate an athlete's overall lower body strength (from the gluteus Maximus to the lower leg muscles). It can help to build squat strength. If performed correctly, the inclined leg press can help develop knees to manage heavier free weights, on the other hand, it has the potential to inflict grave injury: the knees could bend the wrong way if they are locked during the exercise.",
            "tutorial": "https://youtu.be/hxldG9FX4j4",
            "isFavourite": false,
            "isHold": false,
            "userCreated": false,
            "isLearnt": false,
            "isRotation": false,
            "category": "Lower Body",
            "equipment": "Bodyweight"
        },
        {
            "order": 0,
            "name": "Bulgarian Split Squat",
            "repTime": 4,
            "desc": "As a lower body exercise, it strengthens the muscles of the legs, including the quads, hamstrings, glutes, and calves. Also, as a single-leg exercise, your core is forced to work in overdrive to maintain your balance.",
            "tutorial": "https://youtu.be/2C-uNgKwPLE",
            "isFavourite": false,
            "isHold": false,
            "userCreated": false,
            "isLearnt": false,
            "isRotation": false,
            "category": "Lower Body",
            "equipment": "Dumbbells"
        },
        {
            "order": 0,
            "name": "Calf Raises",
            "repTime": 1,
            "desc": "Calf raises are a method of exercising the gastrocnemius, tibialis posterior, peroneals and soleus muscles of the lower leg. The movement performed is plantar flexion, a.k.a. ankle extension.",
            "tutorial": "https://youtu.be/-M4-G8p8fmc",
            "isFavourite": false,
            "isHold": false,
            "userCreated": false,
            "isLearnt": false,
            "isRotation": false,
            "category": "Lower Body",
            "equipment": "Dumbbells"
        },
        {
            "order": 0,
            "name": "Dead Lift",
            "repTime": 4,
            "desc": "Deadlift refers to the lifting of dead weight (weight without momentum), such as weights lying on the ground. It is one of the few standard weight training exercises in which all repetitions begin with dead weight. In most other lifts, there is an eccentric (lowering of the weight) phase followed by the concentric (lifting of the weight) phase. During these exercises, a small amount of energy is stored in the stretched muscles and tendons in the eccentric phase if the lifter is not flexible beyond the range of motion.\n\nThere are several positions one can approach when performing the deadlift, which include the conventional deadlift and sumo deadlift.\n\nAlthough this exercise uses the legs and hips as the primary movers, it can also be considered a back exercise. Depending on the style one chooses to use, different muscles will be targeting. For example, with a conventional stance, the back, hamstrings, and glutes will be targeted primarily. With a sumo stance, the quads and glutes will be primarily targeted.",
            "tutorial": "https://youtu.be/r4MzxtBKyNE",
            "isFavourite": false,
            "isHold": false,
            "userCreated": false,
            "isLearnt": false,
            "isRotation": false,
            "category": "All",
            "equipment": "Barbell"
        },
        {
            "order": 0,
            "name": "Plank",
            "repTime": 5,
            "desc": "The most common plank is the forearm plank which is held in a push-up-like position, with the body's weight borne on forearms, elbows, and toes. Many variations exist such as the side plank and the reverse plank. The plank is commonly practiced in Pilates and yoga, and by those training for boxing and other sports.\n\nThe 'extended plank' adds substantial difficulty to the standard plank exercise. To perform the extended plank, a person begins in the push-up position and then extends the arms or hands as far forward as possible.",
            "tutorial": "https://youtu.be/pSHjTRCQxIw",
            "isFavourite": false,
            "isHold": true,
            "userCreated": false,
            "isLearnt": false,
            "isRotation": false,
            "category": "Core",
            "equipment": "Bodyweight"
        },
        {
            "order": 0,
            "name": "Sit-up",
            "repTime": 3,
            "desc": "The sit-up (or curl-up) is an abdominal endurance training exercise to strengthen, tighten and tone the abdominal muscles. It is similar to a crunch (crunches target the rectus abdominis and also work the biceps and external and internal obliques), but sit-ups have a fuller range of motion and condition additional muscles.",
            "tutorial": "https://youtu.be/1fbU_MkV7NE",
            "isFavourite": false,
            "isHold": false,
            "userCreated": false,
            "isLearnt": false,
            "isRotation": true,
            "category": "Core",
            "equipment": "Bodyweight"
        },
        {
            "order": 0,
            "name": "Bicycle Crunch",
            "repTime": 2,
            "desc": "Crunches are a vital part of any muscle-building workout and bicycle crunches are one of the most challenging types. Although they look simple, bicycle crunches work your lower, middle, and upper abs while strengthening your quads and hamstrings. Fortunately, you can modify the crunch to your strength-level and build up to your personal fitness goal.",
            "tutorial": "https://youtu.be/9FGilxCbdz8",
            "isFavourite": false,
            "isHold": false,
            "userCreated": false,
            "isLearnt": false,
            "isRotation": false,
            "category": "Core",
            "equipment": "Bodyweight"
        },
        {
            "order": 0,
            "name": "Bent-over Row",
            "repTime": 3,
            "desc": "A bent-over row (or barbell row) is a weight training exercise that targets a variety of back muscles. Which ones are targeted varies on form. The bent over row is often used for both bodybuilding and powerlifting. It is a good exercise for increasing strength and size.",
            "tutorial": "https://youtu.be/9efgcAjQe7E",
            "isFavourite": false,
            "isHold": false,
            "userCreated": false,
            "isLearnt": false,
            "isRotation": false,
            "category": "Upper Body",
            "equipment": "Barbell"
        },
        {
            "order": 0,
            "name": "Tricep Dip",
            "repTime": 2,
            "desc": "Tricep dips are an exercise that you can use to build your arms at home, at the gym, or even on a park bench during your morning run. The dip’s accessibility makes it a versatile exercise, but you need to be careful about form to stay safe and get the best results. Try tricep dips on a workout bench, on the floor, and using a dip machine at the gym to see which method works best for you.",
            "tutorial": "https://youtu.be/0326dy_-CzM",
            "isFavourite": false,
            "isHold": false,
            "userCreated": false,
            "isLearnt": false,
            "isRotation": false,
            "category": "Upper Body",
            "equipment": "Bodyweight"
        },
        {
            "order": 0,
            "name": "Push-up",
            "repTime": 2,
            "desc": "A push-up is a common calisthenics exercise beginning from the prone position. By raising and lowering the body using the arms, push-ups exercise the pectoral muscles, triceps, and anterior deltoids, with ancillary benefits to the rest of the deltoids, serratus anterior, coracobrachialis and the midsection as a whole.",
            "tutorial": "https://youtu.be/0326dy_-CzM",
            "isFavourite": false,
            "isHold": false,
            "userCreated": false,
            "isLearnt": false,
            "isRotation": false,
            "category": "Upper Body",
            "equipment": "Bodyweight"
        },
        {
            "order": 0,
            "name": "Hip Raise",
            "repTime": 2,
            "desc": "A hip raise is an exercise to strengthen the lower back, glute muscles, lower abdominal muscles, and maintain hip muscle balance. It does not require weights, although they can be placed on the stomach.\n\nThe pelvic floor is a broad sling of muscles, ligaments and sheet-like tissues that stretch from your pubic bone at the front of your body, to the base of your spine at the back.\n\nThe pelvic floor is resistant to stretch and weight as it bounces back. However, after carrying weight for long periods of time, it can become stretched. Additionally, weight on the pelvic floor can weaken its resistance and contribute to its loss of shape over time.",
            "tutorial": "https://youtu.be/wPM8icPu6H8",
            "isFavourite": false,
            "isHold": false,
            "userCreated": false,
            "isLearnt": false,
            "isRotation": false,
            "category": "All",
            "equipment": "Bodyweight"
        },
        {
            "order": 0,
            "name": "Bench Press",
            "repTime": 2,
            "desc": "The bench press, or chest press, is an upper-body weight training exercise in which the trainee presses a weight upwards while lying on a weight training bench. The exercise uses the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.\n\nThe barbell bench press is one of three lifts in the sport of powerlifting alongside the deadlift and squat, and is the only lift in the sport of Paralympic powerlifting. It is also used extensively in weight training, bodybuilding, and other types of training to develop the chest muscles. Bench press strength is important in combat sports as it tightly correlates to punching power. Bench press can also help contact athletes increase their performance because it can increase effective mass and functional hypertrophy of the upper body.",
            "tutorial": "https://youtu.be/rT7DgCr-3pg",
            "isFavourite": false,
            "isHold": false,
            "userCreated": false,
            "isLearnt": false,
            "isRotation": false,
            "category": "Upper Body",
            "equipment": "Barbell"
        }
    ]
}
